<template>
  <div class="grid gap-12 md:grid-cols-2 lg:grid-cols-3">
    <div v-for="f in features" :key="f.title" class="flex flex-col items-center text-center">
      <img :src="f.image" :alt="f.title" class="mb-4" />
      <h3 class="mb-2 text-xl font-semibold leading-normal text-gray-100">{{ f.title }}</h3>
      <p class="text-base leading-relaxed text-gray-200">{{ f.text }}</p>
    </div>
  </div>
</template>

<script setup>
const features = [
  {
    title: "Терміновість та якість",
    text: "Ми розуміємо, наскільки важливим є час для наших клієнтів. Тому ми працюємо швидко і ефективно, забезпечуючи високу якість на кожному етапі розробки.",
    image: "adv1.svg",
  },
  {
    title: "Широкий спектр послуг",
    text: "Ми пропонуємо повний спектр послуг зі створення інтернет-сторінок, включаючи веб-дизайн, фронтенд та бекенд розробку, UX/UI дизайн, розробку мобільних додатків та інші.",
    image: "adv2.svg",
  },
  {
    title: "Індивідуальний підхід",
    text: "Ми розуміємо, що кожен клієнт та проект є унікальними. Ми готові пристосуватися до ваших потреб та вимог, надаючи гнучкі рішення та індивідуальний підхід до кожного проекту.",
    image: "adv3.svg",
  },
  {
    title: "Творчий підхід",
    text: " Ми віримо в сили інновацій та творчості. Кожен проект, який ми розробляємо, відображає нашу унікальну візію та вміння думати нестандартно.",
    image: "adv4.svg",
  },
  {
    title: "Клієнтська спрямованість",
    text: "Ми слухаємо своїх клієнтів і розуміємо їх потреби. Наш підхід базується на глибокому аналізі та вивченні цільової аудиторії.",
    image: "adv5.svg",
  },
  {
    title: "Постійна підтримка",
    text: "Наша команда знаходиться поруч з вами на кожному етапі проекту. Ми готові надавати консультації, відповіді на питання та технічну підтримку.",
    image: "adv6.svg",
  },
];
</script>

